#დავალება საზეპირო:

#for i in range(41):
    #print(i)

# for ი ეს არის ციკლის keyword 
# i არის საიტერაციო ცვლადი  (იტერაცია ნიშნავს განმეორება)
# in არის ში ხოლო in range არის დიაპაზონში
# range(20) ნიშნავს, რომ შეიქმნება მათემატიკური მიმდევრობა რომლის სიგრძეც არის 20
# range არის მეთოდი რომელსაც არგუმენტად გადაეცა მნიშვნელობა 20


#i = 0
#while  i < 41:
    #print(i)
    #i += 1

# i = 0 ეს არის საიტერაციო ცვლადის დეკლარაცია
# while(სანამ) ეს არის ციკლის შესაქმნელად საჭირო keyword ი 
# ციკლი იმუშავებს იქამდე სანამ i ნაკლებია 41
# თითოეულ დატრიალებაზე დაიპრინტება ჩვენი საიტერაციო ცვლადი i 
    # რომელიც მნიშვნელობას იზრდის 1 ით
# i += 1 ეს არის საიტერაციო ცვლადის ინკრემენტაცია (გაზრდა) 


#დაპრინტეთ 1 - იდან 100-ის ჩათვლით ყველა ლუწი და კენტი რიცხვი და გვერდით მიუწერეთ "ლუწია" "კენტია"

i = 0
while i <=101:
    print(i)
    i = i + 2

i = 1
while i <=100:
    print(i)
    i = i + 2
