#რასაც ისწავლით, ყველაფერი გადაიტანეთ კოდში და გატესტეთ. ნამუშევარი ჩაუგდეთ ლუკა მასწავლებელს! 

name = input("what is your name: ")
print("your name is " + name)

age = input("what is your age: ")
print("your age is " + age)

name = input()
print("user entered valou", name)

#Input: Input არის ინფორმაცია, რომელიც გადმოვიტანთ პროგრამაში, რათა ის გამოაკლოს ინფორმაცია და მუშაობდეს ამას უფრო ეფექტურად. ამისთვის, ინფორმაცია შეგვიძლია წავიკითხოთ სტრინგის სახით, ფაილის სახით, კლავიატურის მიხედვით, და სხვა შესაძლებლობით.
#Output: Output არის ინფორმაცია, რომელიც წარმოადგენს პროგრამის გაშვების შედეგს ან სისტემის პასუხს. ამისთვის, ინფორმაცია გამოგვიტანს გარკვეულ ფორმატში, როგორიცაა ტექსტი, გრაფიკული იმავე მსგავსი მასივი.

